package ch99_연습;
/*
    추상 클래스
        추상클 래스는 완성된 물건이 아니라, '설계도 초안'
        어떤 클래스들이 꼭 따라야 할 기본틀(형태)만 제공하고
        실제로 어떻게 작동해야할지는 자식 클래스(상속받는 클래스)가 정해야한다

        //추상클래스 vs 인터페이스
        추상클래스
            일반클래스와 같은걸 같을수 있는데 추상메서드를 하나만 갖고있어도 추상클래스다
        인터페이스
            인터페이스는 상속이 되지 않기 때문에

        **상속필수
        **입반 메서드 포함 가능

        추상 클래스가 필요한이유
            - 여러 클래스들이 공통적인 구조를 가지게 하려고
            - 기능의 기본 뼈대만 만들고, 실제 내용은 각 클래스에 맡기기 위해
            - 객체를 직접 만들 필요는 없고, 공통 기능만 미리 정의 할때 유용
*/
public class Ex33_추상클래스 {
}
