package ch99_연습;

/*
    컬렉션 프레임워크
        컬럭션은 다수의 데이터를 뜻함, 프레암 워크는 표준화된 프로그래밍 방식을 의미함
        쉽게 말하면 데이터 그룹을 저장하는 클래스들을 표준화 (효율적으로 저장/ 관리를  할수 있는 기능 제공)한 설계임
        (다수의 데이터를 하나의 그룹으로 묶어서 효율적으로 저장/ 관리 할 수 있는  기능을 제공)

        예를들어 배열은 크기가 고정되어 있고, 컬렉션 프레임워크는 가변적인 특징을 갖는다.
        또한 데이터 삽입, 탑색, 정렬 같은 API가 제공됨

       컬렉션 프레임 워크에서 핵심은 인터페이스
            컬렉션 프레임워크에서는 여러 인터페이스가 정의 되어있고, 그 인터페이스를 구현한 많은 클레스들이 있다
            대표적 인 인터페이스는 List, Set, Map (Collection 이 최고 조상, 그 아래 list, set 이 있음, Map은 별개)

*/

public class Ex99_컬랙션프레임워크 {
}
